{
    "id": "17:31:27",
    "results": [
        {
            "displayName": "kube-state-metrics-v2",
            "sourcePath": "./json/kube-state-metrics-v2.json",
            "warnings": [
                "constant template variable with name datasource was skipped because it's type was not supported",
                "Panel 'Cluster': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'Node': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'Deployments': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'Statefuleset': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'Pods': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'Containers': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'HPA': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'Jobs': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'PVC': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'pvc is not bound' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'pvc' was skipped as the maximum number of tiles: 40 has been reached"
            ],
            "errors": [],
            "outputPath": "reports/2023-9-7/17:31:27/kube-state-metrics-v2.json"
        },
        {
            "displayName": "Node Exporter Full",
            "sourcePath": "./json/kubernetes_nodes.json",
            "warnings": [
                "datasource template variable with name DS_PROMETHEUS was skipped because it's type was not supported",
                "custom template variable with name diskdevices was skipped because it's type was not supported",
                "Panel 'Quick CPU / Mem / Disk': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'Basic CPU / Mem / Net / Disk': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'CPU / Memory / Net / Disk': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'Memory Meminfo': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'Memory Vmstat': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'Memory Page Faults' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'OOM Killer' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'System Timesync': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'Time Synchronized Drift' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Time PLL Adjust' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Time Synchronized Status' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Time Misc' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'System Processes': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'Processes Status' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Processes State' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Processes  Forks' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Processes Memory' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'PIDs Number and Limit' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Process schedule stats Running / Waiting' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Threads Number and Limit' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'System Misc': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'Context Switches / Interrupts' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'System Load' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Interrupts Detail' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Schedule timeslices executed by each cpu' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Entropy' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'CPU time spent in user and system contexts' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'File Descriptors' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Hardware Misc': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'Hardware temperature monitor' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Throttle cooling device' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Power supply' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Systemd': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'Systemd Sockets' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Systemd Units State' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Storage Disk': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'Disk IOps Completed' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Disk R/W Data' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Disk Average Wait Time' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Average Queue Size' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Disk R/W Merged' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Time Spent Doing I/Os' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Instantaneous Queue Size' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Disk IOps Discards completed / merged' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Storage Filesystem': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'Filesystem space available' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'File Nodes Free' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'File Descriptor' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'File Nodes Size' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Filesystem in ReadOnly / Error' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Network Traffic': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'Network Traffic by Packets' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Network Traffic Errors' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Network Traffic Drop' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Network Traffic Compressed' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Network Traffic Multicast' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Network Traffic Fifo' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Network Traffic Frame' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Network Traffic Carrier' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Network Traffic Colls' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'NF Contrack' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'ARP Entries' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'MTU' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Speed' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Queue Length' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Softnet Packets' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Softnet Out of Quota' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Network Operational Status' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Network Sockstat': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'Sockstat TCP' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Sockstat UDP' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Sockstat FRAG / RAW' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Sockstat Memory Size' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Sockstat Used' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Network Netstat': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'Netstat IP In / Out Octets' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Netstat IP Forwarding' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'ICMP In / Out' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'ICMP Errors' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'UDP In / Out' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'UDP Errors' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'TCP In / Out' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'TCP Errors' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'TCP Connections' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'TCP SynCookie' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'TCP Direct Transition' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'TCP Stat' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Node Exporter': Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel 'Node Exporter Scrape Time' was skipped as the maximum number of tiles: 40 has been reached",
                "Panel 'Node Exporter Scrape' was skipped as the maximum number of tiles: 40 has been reached"
            ],
            "errors": [],
            "outputPath": "reports/2023-9-7/17:31:27/kubernetes_nodes.json"
        }
    ],
    "sourcePath": "./json/",
    "outputPath": "reports/2023-9-7/17:31:27/",
    "date": "2023-9-7"
}