{
    "id": "20226",
    "results": [
        {
            "displayName": "Node Exporter Full",
            "sourcePath": "./test/test.json",
            "warnings": [
                "Panel Quick CPU / Mem / Disk: Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel Basic CPU / Mem / Net / Disk: Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel CPU / Memory / Net / Disk: Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel Memory Meminfo: Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel Memory Vmstat: Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel System Timesync: Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel System Processes: Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel System Misc: Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel Hardware Misc: Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel Systemd: Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel Storage Disk: Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel Storage Filesystem: Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel Network Traffic: Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel Network Sockstat: Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel Network Netstat: Collapsible groups currently are not yet fully supported. Charts will be unnested",
                "Panel Node Exporter: Collapsible groups currently are not yet fully supported. Charts will be unnested"
            ],
            "errors": [],
            "outputPath": "reports/8-21-2023/20226/test.json"
        }
    ],
    "sourcePath": "./test/test.json",
    "outputPath": "reports/8-21-2023/20226/",
    "date": "8-21-2023"
}